backend/tests/load/ingestion.yml
# Artillery load test: ingestion /track
# Run: npx artillery run backend/tests/load/ingestion.yml
# With custom target: npx artillery run backend/tests/load/ingestion.yml --target http://localhost:8000

config:
  target: "http://localhost:8000"
  phases:
    - name: "light"
      duration: 90
      arrivalRate: 100
    - name: "medium"
      duration: 60
      arrivalRate: 400
    - name: "heavy"
      duration: 30
      arrivalRate: 1000

scenarios:
  - name: "Track PAGEVIEW"
    weight: 1
    flow:
      - post:
          url: "/api/v1/track?v=1&tid=pk-Xkv3t0YD5qr5YQbmDHLvBphErLe79&t=PAGEVIEW&cid=3fa85f64-5717-4562-b3fc-2c963f66afa6&sid=7c9e6679-7425-40de-944b-e07fc1f90ae7&dl=http%3A%2F%2Flocalhost%3A3000%2Fproducts%2F123&dt=Product%20Details&dr=https%3A%2F%2Fwww.google.com&en=null&ep=&sr=1920x1080&vp=1024x768&ul=en-US&ts=1738584000000&z=0.12345&debug=false"